var data = {
        "Total": 0,
        "ElapsedTime": 0,
        "Hits": [],
        "Aggregations": [
            {
                "AggKey": "province",
                "Items": [
                    {
                        "N": "广东省",
                        "C": 381930,
                        "S": null
                    },
                    {
                        "N": "浙江省",
                        "C": 229022,
                        "S": null
                    },
                    {
                        "N": "北京市",
                        "C": 216073,
                        "S": null
                    },
                    {
                        "N": "江苏省",
                        "C": 206999,
                        "S": null
                    },
                    {
                        "N": "上海市",
                        "C": 168006,
                        "S": null
                    },
                    {
                        "N": "山东省",
                        "C": 127250,
                        "S": null
                    },
                    {
                        "N": "四川省",
                        "C": 89246,
                        "S": null
                    },
                    {
                        "N": "福建省",
                        "C": 86255,
                        "S": null
                    },
                    {
                        "N": "湖北省",
                        "C": 75089,
                        "S": null
                    },
                    {
                        "N": "安徽省",
                        "C": 70442,
                        "S": null
                    },
                    {
                        "N": "湖南省",
                        "C": 66931,
                        "S": null
                    },
                    {
                        "N": "辽宁省",
                        "C": 59768,
                        "S": null
                    },
                    {
                        "N": "河南省",
                        "C": 59363,
                        "S": null
                    },
                    {
                        "N": "河北省",
                        "C": 45791,
                        "S": null
                    },
                    {
                        "N": "重庆市",
                        "C": 40150,
                        "S": null
                    },
                    {
                        "N": "天津市",
                        "C": 35664,
                        "S": null
                    },
                    {
                        "N": "新疆维吾尔自治区",
                        "C": 35648,
                        "S": null
                    },
                    {
                        "N": "陕西省",
                        "C": 35093,
                        "S": null
                    },
                    {
                        "N": "吉林省",
                        "C": 34368,
                        "S": null
                    },
                    {
                        "N": "山西省",
                        "C": 31992,
                        "S": null
                    },
                    {
                        "N": "云南省",
                        "C": 31038,
                        "S": null
                    },
                    {
                        "N": "江西省",
                        "C": 30086,
                        "S": null
                    },
                    {
                        "N": "广西壮族自治区",
                        "C": 29690,
                        "S": null
                    },
                    {
                        "N": "黑龙江省",
                        "C": 27620,
                        "S": null
                    },
                    {
                        "N": "海南省",
                        "C": 27558,
                        "S": null
                    },
                    {
                        "N": "内蒙古自治区",
                        "C": 23126,
                        "S": null
                    },
                    {
                        "N": "甘肃省",
                        "C": 22820,
                        "S": null
                    },
                    {
                        "N": "贵州省",
                        "C": 18783,
                        "S": null
                    },
                    {
                        "N": "青海省",
                        "C": 11971,
                        "S": null
                    },
                    {
                        "N": "宁夏回族自治区",
                        "C": 10964,
                        "S": null
                    },
                    {
                        "N": "西藏自治区",
                        "C": 7714,
                        "S": null
                    },
                    {
                        "N": "预披露",
                        "C": 2150,
                        "S": null
                    },
                    {
                        "N": "监管",
                        "C": 1852,
                        "S": null
                    },
                    {
                        "N": "",
                        "C": 310,
                        "S": null
                    },
                    {
                        "N": "深圳市",
                        "C": 130,
                        "S": null
                    }
                ]
            },
            {
                "AggKey": "company",
                "Items": [
                    {
                        "N": "预披露",
                        "C": 2150,
                        "S": null
                    },
                    {
                        "N": "000671 阳光城",
                        "C": 2125,
                        "S": null
                    },
                    {
                        "N": "600340 华夏幸福",
                        "C": 2060,
                        "S": null
                    },
                    {
                        "N": "002183 怡亚通",
                        "C": 2000,
                        "S": null
                    },
                    {
                        "N": "002092 中泰化学",
                        "C": 1961,
                        "S": null
                    },
                    {
                        "N": "000100 TCL集团",
                        "C": 1865,
                        "S": null
                    },
                    {
                        "N": "000415 渤海金控",
                        "C": 1803,
                        "S": null
                    },
                    {
                        "N": "000656 金科股份",
                        "C": 1799,
                        "S": null
                    },
                    {
                        "N": "000851 高鸿股份",
                        "C": 1794,
                        "S": null
                    },
                    {
                        "N": "000046 泛海控股",
                        "C": 1791,
                        "S": null
                    },
                    {
                        "N": "000776 广发证券",
                        "C": 1768,
                        "S": null
                    },
                    {
                        "N": "000555 神州信息",
                        "C": 1762,
                        "S": null
                    },
                    {
                        "N": "000536 华映科技",
                        "C": 1707,
                        "S": null
                    },
                    {
                        "N": "600208 新湖中宝",
                        "C": 1704,
                        "S": null
                    },
                    {
                        "N": "000736 中房地产",
                        "C": 1700,
                        "S": null
                    },
                    {
                        "N": "000725 京东方",
                        "C": 1681,
                        "S": null
                    },
                    {
                        "N": "600157 永泰能源",
                        "C": 1680,
                        "S": null
                    },
                    {
                        "N": "600401 海润光伏",
                        "C": 1666,
                        "S": null
                    },
                    {
                        "N": "000693 华泽钴镍",
                        "C": 1650,
                        "S": null
                    },
                    {
                        "N": "000931 中关村",
                        "C": 1639,
                        "S": null
                    },
                    {
                        "N": "000826 启迪桑德",
                        "C": 1633,
                        "S": null
                    },
                    {
                        "N": "000732 泰禾集团",
                        "C": 1617,
                        "S": null
                    },
                    {
                        "N": "600595 中孚实业",
                        "C": 1616,
                        "S": null
                    },
                    {
                        "N": "002024 苏宁云商",
                        "C": 1614,
                        "S": null
                    },
                    {
                        "N": "002121 科陆电子",
                        "C": 1605,
                        "S": null
                    },
                    {
                        "N": "000592 平潭发展",
                        "C": 1604,
                        "S": null
                    },
                    {
                        "N": "600728 佳都科技",
                        "C": 1587,
                        "S": null
                    },
                    {
                        "N": "000156 华数传媒",
                        "C": 1573,
                        "S": null
                    },
                    {
                        "N": "000802 北京文化",
                        "C": 1569,
                        "S": null
                    },
                    {
                        "N": "000932 华菱钢铁",
                        "C": 1559,
                        "S": null
                    },
                    {
                        "N": "002002 鸿达兴业",
                        "C": 1554,
                        "S": null
                    },
                    {
                        "N": "000875 吉电股份",
                        "C": 1546,
                        "S": null
                    },
                    {
                        "N": "000925 众合科技",
                        "C": 1538,
                        "S": null
                    },
                    {
                        "N": "002102 冠福股份",
                        "C": 1530,
                        "S": null
                    },
                    {
                        "N": "600759 洲际油气",
                        "C": 1529,
                        "S": null
                    },
                    {
                        "N": "600711 盛屯矿业",
                        "C": 1519,
                        "S": null
                    },
                    {
                        "N": "002146 荣盛发展",
                        "C": 1511,
                        "S": null
                    },
                    {
                        "N": "000667 美好集团",
                        "C": 1510,
                        "S": null
                    },
                    {
                        "N": "002131 利欧股份",
                        "C": 1479,
                        "S": null
                    },
                    {
                        "N": "000979 中弘股份",
                        "C": 1478,
                        "S": null
                    },
                    {
                        "N": "002052 同洲电子",
                        "C": 1473,
                        "S": null
                    },
                    {
                        "N": "000010 美丽生态",
                        "C": 1470,
                        "S": null
                    },
                    {
                        "N": "000982 中银绒业",
                        "C": 1470,
                        "S": null
                    },
                    {
                        "N": "002306 中科云网",
                        "C": 1468,
                        "S": null
                    },
                    {
                        "N": "002021 中捷资源",
                        "C": 1467,
                        "S": null
                    },
                    {
                        "N": "600196 复星医药",
                        "C": 1467,
                        "S": null
                    },
                    {
                        "N": "000007 全新好",
                        "C": 1462,
                        "S": null
                    },
                    {
                        "N": "600225 天津松江",
                        "C": 1458,
                        "S": null
                    },
                    {
                        "N": "000540 中天城投",
                        "C": 1457,
                        "S": null
                    },
                    {
                        "N": "600795 国电电力",
                        "C": 1454,
                        "S": null
                    }
                ]
            },
            {
                "AggKey": "law",
                "Items": [
                    {
                        "N": "《中华人民共和国公司法》",
                        "C": 947538,
                        "S": null
                    },
                    {
                        "N": "《中华人民共和国证券法》",
                        "C": 468745,
                        "S": null
                    },
                    {
                        "N": "《深圳证券交易所股票上市规则》",
                        "C": 212504,
                        "S": null
                    },
                    {
                        "N": "《上市公司治理准则》",
                        "C": 143959,
                        "S": null
                    },
                    {
                        "N": "《关于在上市公司建立独立董事制度的指导意见》",
                        "C": 138612,
                        "S": null
                    },
                    {
                        "N": "《企业会计准则》",
                        "C": 134672,
                        "S": null
                    },
                    {
                        "N": "《上海证券交易所股票上市规则》",
                        "C": 116452,
                        "S": null
                    },
                    {
                        "N": "《上市公司股东大会规则》",
                        "C": 112985,
                        "S": null
                    },
                    {
                        "N": "《上市公司重大资产重组管理办法》",
                        "C": 105236,
                        "S": null
                    },
                    {
                        "N": "《股票上市规则》",
                        "C": 81299,
                        "S": null
                    },
                    {
                        "N": "《深圳证券交易所创业板股票上市规则》",
                        "C": 77802,
                        "S": null
                    },
                    {
                        "N": "《深圳证券交易所创业板上市公司规范运作指引》",
                        "C": 68778,
                        "S": null
                    },
                    {
                        "N": "《深圳证券交易所中小企业板上市公司规范运作指引》",
                        "C": 66661,
                        "S": null
                    },
                    {
                        "N": "《上市公司收购管理办法》",
                        "C": 63067,
                        "S": null
                    },
                    {
                        "N": "《企业内部控制基本规范》",
                        "C": 62950,
                        "S": null
                    },
                    {
                        "N": "《关于规范上市公司与关联方资金往来及上市公司对外担保若干问题的通知》",
                        "C": 61428,
                        "S": null
                    },
                    {
                        "N": "《上市公司证券发行管理办法》",
                        "C": 60107,
                        "S": null
                    },
                    {
                        "N": "《上市规则》",
                        "C": 55559,
                        "S": null
                    },
                    {
                        "N": "《股东大会规则》",
                        "C": 53152,
                        "S": null
                    },
                    {
                        "N": "《上市公司信息披露管理办法》",
                        "C": 49561,
                        "S": null
                    },
                    {
                        "N": "《证券发行上市保荐业务管理办法》",
                        "C": 47400,
                        "S": null
                    },
                    {
                        "N": "《公开发行证券的公司信息披露解释性公告第1号——非经常性损益》",
                        "C": 45769,
                        "S": null
                    },
                    {
                        "N": "《管理办法》",
                        "C": 44813,
                        "S": null
                    },
                    {
                        "N": "《关于规范上市公司对外担保行为的通知》",
                        "C": 41028,
                        "S": null
                    },
                    {
                        "N": "《募集资金管理办法》",
                        "C": 34810,
                        "S": null
                    },
                    {
                        "N": "《上市公司非公开发行股票实施细则》",
                        "C": 32858,
                        "S": null
                    },
                    {
                        "N": "《企业会计准则第33号——合并财务报表》",
                        "C": 31898,
                        "S": null
                    },
                    {
                        "N": "《企业会计准则第22号——金融工具确认和计量》",
                        "C": 30376,
                        "S": null
                    },
                    {
                        "N": "《关于加强社会公众股股东权益保护的若干规定》",
                        "C": 29348,
                        "S": null
                    },
                    {
                        "N": "《中华人民共和国企业所得税法》",
                        "C": 29323,
                        "S": null
                    },
                    {
                        "N": "《关于进一步落实上市公司现金分红有关事项的通知》",
                        "C": 28656,
                        "S": null
                    },
                    {
                        "N": "《上市公司股权分置改革管理办法》",
                        "C": 28629,
                        "S": null
                    },
                    {
                        "N": "《企业会计准则——基本准则》",
                        "C": 27857,
                        "S": null
                    },
                    {
                        "N": "《上市公司股权激励管理办法（试行）》",
                        "C": 27485,
                        "S": null
                    },
                    {
                        "N": "《企业会计准则第2号——长期股权投资》",
                        "C": 26501,
                        "S": null
                    },
                    {
                        "N": "《上市公司章程指引》",
                        "C": 26037,
                        "S": null
                    },
                    {
                        "N": "《上市公司监管指引第2号——上市公司募集资金管理和使用的监管要求》",
                        "C": 23403,
                        "S": null
                    },
                    {
                        "N": "《上市公司股东持股变动信息披露管理办法》",
                        "C": 23342,
                        "S": null
                    },
                    {
                        "N": "《重组管理办法》",
                        "C": 22306,
                        "S": null
                    },
                    {
                        "N": "《企业会计准则—基本准则》",
                        "C": 22014,
                        "S": null
                    },
                    {
                        "N": "《律师事务所从事证券法律业务管理办法》",
                        "C": 21629,
                        "S": null
                    },
                    {
                        "N": "《公务员法》",
                        "C": 20392,
                        "S": null
                    },
                    {
                        "N": "《上市公司股东大会规范意见》",
                        "C": 20247,
                        "S": null
                    },
                    {
                        "N": "《企业会计准则第14号——收入》",
                        "C": 20247,
                        "S": null
                    },
                    {
                        "N": "《公开发行证券的公司信息披露编报规则第15号——财务报告的一般规定》",
                        "C": 19860,
                        "S": null
                    },
                    {
                        "N": "《重组办法》",
                        "C": 19616,
                        "S": null
                    },
                    {
                        "N": "《关于规范上市公司重大资产重组若干问题的规定》",
                        "C": 19399,
                        "S": null
                    },
                    {
                        "N": "《上市公司高级管理人员培训工作指引》",
                        "C": 19300,
                        "S": null
                    },
                    {
                        "N": "《深圳证券交易所投资者网络服务身份认证业务实施细则》",
                        "C": 19093,
                        "S": null
                    },
                    {
                        "N": "《企业会计准则第13号——或有事项》",
                        "C": 18901,
                        "S": null
                    }
                ]
            },
            {
                "AggKey": "notice",
                "Items": [
                    {
                        "N": "20",
                        "C": 569529,
                        "S": null
                    },
                    {
                        "N": "13",
                        "C": 308365,
                        "S": null
                    },
                    {
                        "N": "14",
                        "C": 256546,
                        "S": null
                    },
                    {
                        "N": "19",
                        "C": 240842,
                        "S": null
                    },
                    {
                        "N": "18",
                        "C": 195332,
                        "S": null
                    },
                    {
                        "N": "11",
                        "C": 118033,
                        "S": null
                    },
                    {
                        "N": "15",
                        "C": 87281,
                        "S": null
                    },
                    {
                        "N": "2",
                        "C": 61663,
                        "S": null
                    },
                    {
                        "N": "24",
                        "C": 61017,
                        "S": null
                    },
                    {
                        "N": "12",
                        "C": 59597,
                        "S": null
                    },
                    {
                        "N": "1",
                        "C": 59570,
                        "S": null
                    },
                    {
                        "N": "7",
                        "C": 56162,
                        "S": null
                    },
                    {
                        "N": "5",
                        "C": 53619,
                        "S": null
                    },
                    {
                        "N": "23",
                        "C": 42759,
                        "S": null
                    },
                    {
                        "N": "4",
                        "C": 40693,
                        "S": null
                    },
                    {
                        "N": "3",
                        "C": 38128,
                        "S": null
                    },
                    {
                        "N": "22",
                        "C": 33945,
                        "S": null
                    },
                    {
                        "N": "17",
                        "C": 17825,
                        "S": null
                    },
                    {
                        "N": "21",
                        "C": 15766,
                        "S": null
                    },
                    {
                        "N": "10",
                        "C": 8173,
                        "S": null
                    },
                    {
                        "N": "8",
                        "C": 3821,
                        "S": null
                    },
                    {
                        "N": "16",
                        "C": 3774,
                        "S": null
                    },
                    {
                        "N": "6",
                        "C": 2681,
                        "S": null
                    },
                    {
                        "N": "9",
                        "C": 2591,
                        "S": null
                    },
                    {
                        "N": "30",
                        "C": 2150,
                        "S": null
                    },
                    {
                        "N": "40",
                        "C": 1852,
                        "S": null
                    }
                ]
            },
            {
                "AggKey": "parentIndustry",
                "Items": [
                    {
                        "N": "制造业",
                        "C": 1406020,
                        "S": {
                            "AggKey": "industry",
                            "Items": [
                                {
                                    "N": "计算机、通信和其他电子设备制造业",
                                    "C": 207477,
                                    "S": null
                                },
                                {
                                    "N": "化学原料和化学制品制造业",
                                    "C": 147318,
                                    "S": null
                                },
                                {
                                    "N": "电气机械和器材制造业",
                                    "C": 145790,
                                    "S": null
                                },
                                {
                                    "N": "医药制造业",
                                    "C": 132830,
                                    "S": null
                                },
                                {
                                    "N": "专用设备制造业",
                                    "C": 108660,
                                    "S": null
                                },
                                {
                                    "N": "通用设备制造业",
                                    "C": 80588,
                                    "S": null
                                },
                                {
                                    "N": "汽车制造业",
                                    "C": 67148,
                                    "S": null
                                },
                                {
                                    "N": "非金属矿物制品业",
                                    "C": 64598,
                                    "S": null
                                },
                                {
                                    "N": "有色金属冶炼和压延加工业",
                                    "C": 51633,
                                    "S": null
                                },
                                {
                                    "N": "橡胶和塑料制品业",
                                    "C": 38110,
                                    "S": null
                                },
                                {
                                    "N": "金属制品业",
                                    "C": 36334,
                                    "S": null
                                },
                                {
                                    "N": "农副食品加工业",
                                    "C": 33092,
                                    "S": null
                                },
                                {
                                    "N": "纺织业",
                                    "C": 31274,
                                    "S": null
                                },
                                {
                                    "N": "铁路、船舶、航空航天和其他运输设备制造业",
                                    "C": 30089,
                                    "S": null
                                },
                                {
                                    "N": "黑色金属冶炼和压延加工业",
                                    "C": 29539,
                                    "S": null
                                },
                                {
                                    "N": "酒、饮料和精制茶制造业",
                                    "C": 26979,
                                    "S": null
                                },
                                {
                                    "N": "造纸和纸制品业",
                                    "C": 23705,
                                    "S": null
                                },
                                {
                                    "N": "食品制造业",
                                    "C": 22494,
                                    "S": null
                                },
                                {
                                    "N": "纺织服装、服饰业",
                                    "C": 20005,
                                    "S": null
                                },
                                {
                                    "N": "仪器仪表制造业",
                                    "C": 19605,
                                    "S": null
                                },
                                {
                                    "N": "化学纤维制造业",
                                    "C": 18399,
                                    "S": null
                                },
                                {
                                    "N": "其他制造业",
                                    "C": 16107,
                                    "S": null
                                },
                                {
                                    "N": "石油加工、炼焦和核燃料加工业",
                                    "C": 16017,
                                    "S": null
                                },
                                {
                                    "N": "文教、工美、体育和娱乐用品制造业",
                                    "C": 8586,
                                    "S": null
                                },
                                {
                                    "N": "木材加工和木、竹、藤、棕、草制品业",
                                    "C": 8127,
                                    "S": null
                                },
                                {
                                    "N": "家具制造业",
                                    "C": 5873,
                                    "S": null
                                },
                                {
                                    "N": "印刷和记录媒介复制业",
                                    "C": 5734,
                                    "S": null
                                },
                                {
                                    "N": "皮革、毛皮、羽毛及其制品和制鞋业",
                                    "C": 3587,
                                    "S": null
                                },
                                {
                                    "N": "废弃资源综合利用业",
                                    "C": 3230,
                                    "S": null
                                },
                                {
                                    "N": "铁路、船舶、航空航天和其它运输设备制造业",
                                    "C": 2035,
                                    "S": null
                                },
                                {
                                    "N": "化学原料及化学制品制造业",
                                    "C": 1057,
                                    "S": null
                                }
                            ]
                        }
                    },
                    {
                        "N": "信息传输、软件和信息技术服务业",
                        "C": 143893,
                        "S": {
                            "AggKey": "industry",
                            "Items": [
                                {
                                    "N": "软件和信息技术服务业",
                                    "C": 106304,
                                    "S": null
                                },
                                {
                                    "N": "互联网和相关服务",
                                    "C": 27131,
                                    "S": null
                                },
                                {
                                    "N": "电信、广播电视和卫星传输服务",
                                    "C": 10458,
                                    "S": null
                                }
                            ]
                        }
                    },
                    {
                        "N": "房地产业",
                        "C": 140615,
                        "S": {
                            "AggKey": "industry",
                            "Items": [
                                {
                                    "N": "房地产业",
                                    "C": 140615,
                                    "S": null
                                }
                            ]
                        }
                    },
                    {
                        "N": "批发和零售业",
                        "C": 125635,
                        "S": {
                            "AggKey": "industry",
                            "Items": [
                                {
                                    "N": "零售业",
                                    "C": 66458,
                                    "S": null
                                },
                                {
                                    "N": "批发业",
                                    "C": 59177,
                                    "S": null
                                }
                            ]
                        }
                    },
                    {
                        "N": "电力、热力、燃气及水的生产和供应业",
                        "C": 86530,
                        "S": {
                            "AggKey": "industry",
                            "Items": [
                                {
                                    "N": "电力、热力生产和供应业",
                                    "C": 62005,
                                    "S": null
                                },
                                {
                                    "N": "水的生产和供应业",
                                    "C": 12705,
                                    "S": null
                                },
                                {
                                    "N": "燃气生产和供应业",
                                    "C": 11820,
                                    "S": null
                                }
                            ]
                        }
                    },
                    {
                        "N": "交通运输、仓储和邮政业",
                        "C": 68540,
                        "S": {
                            "AggKey": "industry",
                            "Items": [
                                {
                                    "N": "水上运输业",
                                    "C": 25334,
                                    "S": null
                                },
                                {
                                    "N": "道路运输业",
                                    "C": 21891,
                                    "S": null
                                },
                                {
                                    "N": "航空运输业",
                                    "C": 9833,
                                    "S": null
                                },
                                {
                                    "N": "仓储业",
                                    "C": 7148,
                                    "S": null
                                },
                                {
                                    "N": "铁路运输业",
                                    "C": 2606,
                                    "S": null
                                },
                                {
                                    "N": "装卸搬运和运输代理业",
                                    "C": 1539,
                                    "S": null
                                },
                                {
                                    "N": "管道运输业",
                                    "C": 189,
                                    "S": null
                                }
                            ]
                        }
                    },
                    {
                        "N": "建筑业",
                        "C": 67929,
                        "S": {
                            "AggKey": "industry",
                            "Items": [
                                {
                                    "N": "土木工程建筑业",
                                    "C": 48264,
                                    "S": null
                                },
                                {
                                    "N": "建筑装饰和其他建筑业",
                                    "C": 18555,
                                    "S": null
                                },
                                {
                                    "N": "房屋建筑业",
                                    "C": 1064,
                                    "S": null
                                },
                                {
                                    "N": "建筑安装业",
                                    "C": 46,
                                    "S": null
                                }
                            ]
                        }
                    },
                    {
                        "N": "采矿业",
                        "C": 63636,
                        "S": {
                            "AggKey": "industry",
                            "Items": [
                                {
                                    "N": "有色金属矿采选业",
                                    "C": 23163,
                                    "S": null
                                },
                                {
                                    "N": "煤炭开采和洗选业",
                                    "C": 22113,
                                    "S": null
                                },
                                {
                                    "N": "开采辅助活动",
                                    "C": 8736,
                                    "S": null
                                },
                                {
                                    "N": "黑色金属矿采选业",
                                    "C": 5198,
                                    "S": null
                                },
                                {
                                    "N": "石油和天然气开采业",
                                    "C": 4426,
                                    "S": null
                                }
                            ]
                        }
                    },
                    {
                        "N": "金融业",
                        "C": 47720,
                        "S": {
                            "AggKey": "industry",
                            "Items": [
                                {
                                    "N": "资本市场服务",
                                    "C": 23954,
                                    "S": null
                                },
                                {
                                    "N": "货币金融服务",
                                    "C": 13049,
                                    "S": null
                                },
                                {
                                    "N": "其他金融业",
                                    "C": 6236,
                                    "S": null
                                },
                                {
                                    "N": "保险业",
                                    "C": 4481,
                                    "S": null
                                }
                            ]
                        }
                    },
                    {
                        "N": "农、林、牧、渔业",
                        "C": 36620,
                        "S": {
                            "AggKey": "industry",
                            "Items": [
                                {
                                    "N": "农业",
                                    "C": 13382,
                                    "S": null
                                },
                                {
                                    "N": "畜牧业",
                                    "C": 10288,
                                    "S": null
                                },
                                {
                                    "N": "渔业",
                                    "C": 7680,
                                    "S": null
                                },
                                {
                                    "N": "林业",
                                    "C": 4311,
                                    "S": null
                                },
                                {
                                    "N": "农、林、牧、渔服务业",
                                    "C": 959,
                                    "S": null
                                }
                            ]
                        }
                    },
                    {
                        "N": "租赁和商务服务业",
                        "C": 34808,
                        "S": {
                            "AggKey": "industry",
                            "Items": [
                                {
                                    "N": "商务服务业",
                                    "C": 31174,
                                    "S": null
                                },
                                {
                                    "N": "租赁业",
                                    "C": 3634,
                                    "S": null
                                }
                            ]
                        }
                    },
                    {
                        "N": "文化、体育和娱乐业",
                        "C": 34302,
                        "S": {
                            "AggKey": "industry",
                            "Items": [
                                {
                                    "N": "新闻和出版业",
                                    "C": 15055,
                                    "S": null
                                },
                                {
                                    "N": "广播、电视、电影和影视录音制作业",
                                    "C": 14140,
                                    "S": null
                                },
                                {
                                    "N": "文化艺术业",
                                    "C": 5107,
                                    "S": null
                                }
                            ]
                        }
                    },
                    {
                        "N": "水利、环境和公共设施管理业",
                        "C": 25262,
                        "S": {
                            "AggKey": "industry",
                            "Items": [
                                {
                                    "N": "公共设施管理业",
                                    "C": 13221,
                                    "S": null
                                },
                                {
                                    "N": "生态保护和环境治理业",
                                    "C": 12041,
                                    "S": null
                                }
                            ]
                        }
                    },
                    {
                        "N": "综合",
                        "C": 22358,
                        "S": {
                            "AggKey": "industry",
                            "Items": [
                                {
                                    "N": "综合",
                                    "C": 22358,
                                    "S": null
                                }
                            ]
                        }
                    },
                    {
                        "N": "科学研究和技术服务业",
                        "C": 12496,
                        "S": {
                            "AggKey": "industry",
                            "Items": [
                                {
                                    "N": "专业技术服务业",
                                    "C": 10951,
                                    "S": null
                                },
                                {
                                    "N": "研究和试验发展",
                                    "C": 1545,
                                    "S": null
                                }
                            ]
                        }
                    },
                    {
                        "N": "住宿和餐饮业",
                        "C": 10723,
                        "S": {
                            "AggKey": "industry",
                            "Items": [
                                {
                                    "N": "住宿业",
                                    "C": 7596,
                                    "S": null
                                },
                                {
                                    "N": "餐饮业",
                                    "C": 3127,
                                    "S": null
                                }
                            ]
                        }
                    },
                    {
                        "N": "卫生和社会工作业",
                        "C": 6459,
                        "S": {
                            "AggKey": "industry",
                            "Items": [
                                {
                                    "N": "卫生",
                                    "C": 6459,
                                    "S": null
                                }
                            ]
                        }
                    },
                    {
                        "N": "预披露",
                        "C": 2150,
                        "S": {
                            "AggKey": "industry",
                            "Items": [
                                {
                                    "N": "其他",
                                    "C": 2150,
                                    "S": null
                                }
                            ]
                        }
                    },
                    {
                        "N": "监管",
                        "C": 1852,
                        "S": {
                            "AggKey": "industry",
                            "Items": [
                                {
                                    "N": "监管",
                                    "C": 1852,
                                    "S": null
                                }
                            ]
                        }
                    },
                    {
                        "N": "教育",
                        "C": 960,
                        "S": {
                            "AggKey": "industry",
                            "Items": [
                                {
                                    "N": "教育",
                                    "C": 960,
                                    "S": null
                                }
                            ]
                        }
                    }
                ]
            }
        ],
        "Token": "1y45j4FajgMXYWpCAC4dyFvnI172YYGjxOjBGQbxXsFbxC6Fqh/7krLNtcNgR9Ws/FFIvxpEmSA=",
        "Message": null
    }
    var regLawKeyword = new RegExp("[《》]|中华人民共和国", "g");
    var noticeType = new Array("年度报告", "半年度报告", "一季度报告", "三季度报告", "首次公开发行及上市", "配股", "增发", "可转债", "权证", "其他融资", "权益及限制出售股份",
    "股权变动", "交易", "股东大会", "澄清、风险、业绩预告", "特别处理及退市", "补充及更正", "中介机构报告", "上市公司制度", "其他重大事项", "债券公告", "投资者关系", "监事会公告", "董事会公告");

    var arrMarkets = new Array("全部市场类型", "沪市主板", "深市主板", "深市中小板", "深市创业板", "深市全部", "深市主板和中小板");
    var industries = [];
    var provinces = [];
    var companies = [];
    var agencies = [];
    var laws = [];
    var notices = [];
    var statNav = [];
    var lock = false;
//console.info(data.Aggregations);
    //Fill Stat
    var fillStat = function (data) {
        var shortName;
        var inAgg = data.Aggregations || [];
        for (i = 0; i < inAgg.length; i++) {
            switch (inAgg[i].AggKey) {
                case "parentIndustry":
                    for (j = 0; j < inAgg[i].Items.length; j++) {
                        var pushChildIndustry = [];
                        for (k = 0; k < inAgg[i].Items[j].S.Items.length; k++) {
                            pushChildIndustry.push({
                                "childname": inAgg[i].Items[j].S.Items[k].N,
                                "childcount": abbrNum(inAgg[i].Items[j].S.Items[k].C),
                                "childshort": abbr(inAgg[i].Items[j].S.Items[k].N, 10, "...")
                            });
                        }
                        industries.push({ "name": inAgg[i].Items[j].N, "count": abbrNum(inAgg[i].Items[j].C), "childs": pushChildIndustry, "short": abbr(inAgg[i].Items[j].N, 12, "...") });
                    }
                    industries.AggKey = "parentIndustry";
                    break;
                case "province":
                    for (j = 0; j < inAgg[i].Items.length; j++) {
                        provinces.push({ "name": inAgg[i].Items[j].N, "count": abbrNum(inAgg[i].Items[j].C) });
                    }
                    provinces.AggKey = 'province';
                    break;
                case "notice":
                    for (j = 0; j < inAgg[i].Items.length; j++) {
                        var chs;
                        if (inAgg[i].Items[j].N == 30) {
                            chs = "预披露";
                        } else if (inAgg[i].Items[j].N == 40) {
                            chs = "监管文件";
                        } else {
                            chs = noticeType[parseInt(inAgg[i].Items[j].N) - 1];
                        }
                        notices.push({ "name": inAgg[i].Items[j].N, "count": abbrNum(inAgg[i].Items[j].C), "chs": chs });
                    }
                    notices.AggKey = "notice";
                    break;
                case "law":
                    for (j = 0; j < inAgg[i].Items.length; j++) {
                        shortName = abbr(inAgg[i].Items[j].N, 11, "...》");
                        var keyword = inAgg[i].Items[j].N.replace(regLawKeyword, "");
                        laws.push({ "name": inAgg[i].Items[j].N, "count": abbrNum(inAgg[i].Items[j].C), "short": shortName, "keyword": keyword });
                    }
                    laws.AggKey = 'law';
                    break;
                case "company":
                    for (j = 0; j < inAgg[i].Items.length; j++) {
                        companies.push({ "name": inAgg[i].Items[j].N, "count": abbrNum(inAgg[i].Items[j].C) });
                    }
                    companies.AggKey = 'company';
                    break;
            }
        }
        console.info(industries);
        console.info(provinces);
        console.info(companies);
        console.info(agencies);
        console.info(laws);
        console.info(notices);
    }
    fillStat(data);
   /* var updateStatView = function () {
        var data = { "n": flagAt };
        changeStatTab({ "data": data });
        var $statPage, $statFooter;
        switch (flagAt) {
            case 1:
                $statPage = $("#div_industryStat").find("div.pbody");
                $statFooter = $("#div_industryStat").find("ul");
                $statPage.empty();
                if (results.currentStatContent.length == 0) break;
                for (i = 0; i < results.currentStatContent.length; i++) {
                    var industry = results.currentStatContent[i];
                    var $div = $("<div></div>");
                    //Parent Industry
                    var $parent = $("<div class='btn-group btn-group-justified'>");
                    var $button = $("<a role='button' data-toggle='collapse' class='btn btn-default filter' style='color: #444; padding: 3px; border-radius: 0; border-right: 0'><span class='glyphicon glyphicon-plus-sign' style='top: 2px'></span></a>");
                    $button.attr("data-target", "#" + industry.name);
                    $button.bind("click", function () {
                        var $span = $(this).find("span").eq(0);
                        if ($span.hasClass("glyphicon-plus-sign")) {
                            $span.removeClass("glyphicon-plus-sign");
                            $span.addClass("glyphicon-minus-sign");
                        } else {
                            $span.removeClass("glyphicon-minus-sign");
                            $span.addClass("glyphicon-plus-sign");
                        }
                    });
                    var $item = $("<a href='javascript:void(0)' class='btn btn-default filter' style='width:10%; text-align:left'></a>");
                    $item.text(industry.short);
                    $item.bind("click", {
                        "ff": 1,
                        "fv": industry.name,
                        "label": industry.name
                    }, function (e) {
                        addFilter(e);
                    });
                    var $count = $("<span class='badge pull-right'></span>");
                    $count.text(industry.count);
                    $count.prependTo($item);
                    $parent.append($button);
                    $parent.append($item);
                    $div.append($parent);
                    //Child Industry
                    var $child = $("<div class='panel-collapse collapse'>");
                    $child.attr("id", industry.name);
                    for (j = 0; j < industry.childs.length; j++) {
                        var childIndustry = industry.childs[j];
                        var $childItem = $("<a class='list-group-item filter' role='button' href='javascript:void(0)'></a>");
                        $childItem.html("&emsp;&emsp;" + childIndustry.childshort);
                        $childItem.bind("click", {
                            "ff": 11,
                            "fv": childIndustry.childname,
                            "label": childIndustry.childname
                        }, function (e) {
                            addFilter(e);
                        });
                        var $childCount = $("<span class='badge' style='background-color: white; color: #222222; border-style: solid; border-width: 1px; border-color: gray'></span>");
                        $childCount.text(childIndustry.childCount);
                        $childItem.append($childCount);
                        $child.append($childItem);
                    }
                    $div.append($child);
                    $statPage.append($div);
                }
                break;
            case 2:
                $statPage = $("#div_locationStat").find("div.pbody");
                $statFooter = $("#div_locationStat").find("ul");
                $statPage.empty();
                if (results.currentStatContent.length == 0) break;
                for (i = 0; i < results.currentStatContent.length; i++) {
                    $item = $("<a href='javascript:void(0)' class='list-group-item filter'></a>");
                    var province = results.currentStatContent[i];
                    $item.text(province.name);
                    $item.bind("click", {
                        "ff": 2,
                        "fv": province.name,
                        "label": province.name
                    }, function (e) {
                        addFilter(e);
                    });
                    $count = $("<span class='badge'></span>");
                    $count.text(province.count);
                    $count.prependTo($item);
                    $statPage.append($item);
                }
                break;
            case 3:
                $statPage = $("#div_companyStat").find("div.pbody");
                $statFooter = $("#div_companyStat").find("ul");
                $statPage.empty();
                if (results.currentStatContent.length == 0) break;
                for (i = 0; i < results.currentStatContent.length; i++) {
                    $item = $("<a href='javascript:void(0)' class='list-group-item filter'></a>");
                    var company = results.currentStatContent[i];
                    $item.text(company.name);
                    $item.bind("click", {
                        "ff": 3,
                        "fv": company.name,
                        "label": company.name
                    }, function (e) {
                        addFilter(e);
                    });
                    $count = $("<span class='badge'></span>");
                    $count.text(company.count);
                    $count.prependTo($item);
                    $statPage.append($item);
                }
                break;
            case 4:
                $statPage = $("#div_lawStat").find("div.pbody");
                $statFooter = $("#div_lawStat").find("ul");
                $statPage.empty();
                if (results.currentStatContent.length == 0) break;
                for (i = 0; i < results.currentStatContent.length; i++) {
                    var law = results.currentStatContent[i];
                    $div = $(" <div class='btn-group btn-group-justified'></div>");
                    $button = $("<a role='button' target='_blank' class='btn btn-default filter' style='color: #444; padding: 3px; border-radius: 0; border-right: 0'><span class='glyphicon glyphicon-circle-arrow-right' style='top: 2px'></span></a>");
                    $button.attr("href", "/Home/SearchLaw?title=" + law.keyword);
                    $item = $("<a href='javascript:void(0)' class='btn btn-default filter' style='width:10%; text-align:left'></a>");
                    $item.text(law.short);
                    $item.bind("click", {
                        "ff": 4,
                        "fv": law.name,
                        "label": law.name
                    }, function (e) {
                        addFilter(e);
                    });
                    $count = $("<span class='badge pull-right'></span>");
                    $count.text(law.count);
                    $count.prependTo($item);
                    $div.append($button);
                    $div.append($item);
                    $statPage.append($div);
                }
                break;
            case 6:
                $statPage = $("#div_noticeStat").find("div.pbody");
                $statFooter = $("#div_noticeStat").find("ul");
                $statPage.empty();
                if (results.currentStatContent.length == 0) break;
                for (i = 0; i < results.currentStatContent.length; i++) {
                    var notice = results.currentStatContent[i];
                    $item = $("<a href='javascript:void(0)' class='list-group-item filter'></a>");
                    $item.text(notice.chs);
                    $item.bind("click", {
                        "ff": 6,
                        "fv": notice.name,
                        "label": notice.chs
                    }, function (e) {
                        addFilter(e);
                    });
                    $count = $("<span class='badge'></span>");
                    $count.text(notice.count);
                    $count.prependTo($item);
                    $statPage.append($item);
                }
                break;
            default:
        }
        $statFooter.empty();
        for (i = 0; i < results.statNav.length; i++) {
            var $footLink = $("<a href='javascript:void(0)'></a>");
            $footLink.bind("click", { "n": results.statNav[i], "type": flagAt }, function (e) {
                turnStatPage(e);
            });
            $footLink.text(results.statNav[i]);
            if (results.statNav[i] == results.currentStatPage) {
                $footLink.attr("style", "font-weight:bold");
            } else {
                $footLink.attr("style", "");
            }
            var $wrapLink = $("<li></li>");
            $wrapLink.append($footLink);
            $statFooter.append($wrapLink);
        }
    }*/
    //filter类别切换
    $('.filter-title').on('click',function(){
        $(this).parent().find('.filter-list').slideToggle();
        $(this).parent().siblings().find('.filter-list').slideUp();
    })
    $('.filter-title').mouseenter(function(){
        $(this).parent().find('.panel-wrap').show();
        $(this).parent().siblings().find('.panel-wrap').hide();
    })

    //有二级行业
    var Industry =  function(arr,AggKey){
        var $panel_wrap = $('<div class="panel-wrap"></div>');
        for( var j = 0 ;j < Math.ceil(arr.length / 2 );j++){
            var $panel_item = $('<div class="panel-item"></div>');
            var $panel_list = $('<div class="panel-list"></div>');
            var $div1 = $('<div></div>');
            var $div2 = $('<div></div>');
            var $a_left = $('<a href="filter first-industry"></a>');
            var $span_left = $('<span class="count"></span>')
            //小图标
            var $em1 = $('<em class="icon-drop">+</em>');
            var $em2 = $('<em class="icon-drop">+</em>');
            $a_left.text(arr[2*j].short);
            $span_left.text(arr[2*j].count);
            $div1.append($em1);
            $div1.append($a_left);
            $div1.append($span_left);
            var $a_right = $('<a href="filter first-industry"></a>');
            var $span_right = $('<span class="count"></span>')
            $a_right.text(arr[2*j+1].short);
            $span_right.text(arr[2*j+1].count);
            $div2.append($em2);
            $div2.append($a_right);
            $div2.append($span_right);
            $panel_list.append($div1);
            $panel_list.append($div2);
            $panel_item.append($panel_list);
            
            //二级行业
            $em1.bind('click',{childs: arr[2*j].childs},function(e){
                var $second_wrap = $('<div class="second-wrap"></div>');
                $second_wrap.addClass('left');
                if(!lock){
                    lock = true;
                    if($(this).hasClass('one')){
                        console.info($('.second_wrap'));
                        $(this).removeClass('one');
                        $('.second-wrap').remove();
                    }else{
                        $(this).addClass('one');
                        $('.second-wrap').remove();
                        for(var i = 0 ; i < e.data.childs.length; i++ ){
                            var $a = $('<a class="filter" href=""></a>');
                            $a.text(e.data.childs[i].childshort);
                            $second_wrap.append($a);
                        }
                        $(this).parent().parent().append($second_wrap);
                        $(this).parent().parent().find($second_wrap).slideToggle();
                    }  
                }
                lock = false;
            })
            $em2.bind('click',{childs: arr[2*j+1].childs},function(e){
                var $second_wrap = $('<div class="second-wrap"></div>');
                $second_wrap.addClass('right');
                if(!lock){
                    lock = true;
                    if($(this).hasClass('one')){
                        console.info($('.second_wrap'));
                        $(this).removeClass('one');
                        $('.second-wrap').remove();
                    }else{
                        $(this).addClass('one');
                        $('.second-wrap').remove();
                        //生成二级行业
                        for(var i = 0 ; i < e.data.childs.length; i++ ){
                            var $a = $('<a class="filter" href=""></a>');
                            $a.text(e.data.childs[i].childshort);
                            $second_wrap.append($a);
                        }
                        $(this).parent().parent().append($second_wrap);
                        $(this).parent().parent().find($second_wrap).slideToggle();
                    }
                }
                lock = false; 
            })
            $panel_wrap.append($panel_item);
        }
        $('#'+AggKey+'').append($panel_wrap);
        return;
    }
    //非二级行业
    var Other = function(arr,AggKey){
        var $panel_wrap = $('<div class="panel-wrap"></div>');
        for( var j = 0 ;j < Math.ceil(arr.length / 2 );j++){
            var $panel_item = $('<div class="panel-item"></div>');
            var $panel_list = $('<div class="panel-list"></div>');
            var $div1 = $('<div></div>');
            var $div2 = $('<div></div>');
            var $a_left = $('<a href="filter left"></a>');
            var $span_left = $('<span class="count"></span>')
            //小图标
            var $em1 = $('<em class="icon-drop">+</em>');
            var $em2 = $('<em class="icon-drop">+</em>');
            $a_left.text(arr[2*j].short);
            $span_left.text(arr[2*j].count);
            $div1.append($em1);
            $div1.append($a_left);
            $div1.append($span_left);
            var $a_right = $('<a href="filter right"></a>');
            var $span_right = $('<span class="count"></span>')
            $a_right.text(arr[2*j+1].short);
            $span_right.text(arr[2*j+1].count);
            $div2.append($em2);
            $div2.append($a_right);
            $div2.append($span_right);
            $panel_list.append($div1);
            $panel_list.append($div2);
            $panel_item.append($panel_list);
            $panel_wrap.append($panel_item);
        }
        $('#'+AggKey+'').append($panel_wrap);
        return;
    }
    Industry(industries,'industries');
   /* Other(arrMarkets,'arrMarkets');
    Other(notice,'notice');
    Other(province,'province');
    Other(company,'company');*/
    $('.panel-wrap').mouseleave(function(){
        if(!lock){
            $('.panel-wrap').hide();
        }
    })